In [1]:
import pandas as pd

In [2]:
dataset=pd.read_csv("loan.csv")

In [3]:
dataset.isnull().sum()

loan_id               1
Gender                3
Married               3
Dependents            3
Education             5
self_employed         3
applicantincome       4
coapplicant_income    0
loan_amount           0
property              0
dtype: int64

In [4]:
dataset.head(10)

,loan_id,Gender,Married,Dependents,Education,self_employed,applicantincome,coapplicant_income,loan_amount,property
0,12.0,male,no,0.0,graduate,no,453453.0,0,232,urban
1,34.0,female,yes,1.0,NaN,yes,5435.0,3434,232,rural
2,5.0,male,NaN,2.0,ungraduate,NaN,4545.0,3,32,rural
3,65.0,NaN,no,NaN,NaN,no,NaN,3434,2,urban
4,767.0,female,yes,2.0,graduate,NaN,NaN,3445,323,rural
5,8.0,NaN,NaN,NaN,NaN,yes,NaN,454,2,urban
6,78.0,female,NaN,1.0,ungraduate,NaN,NaN,343,32,rural
7,NaN,male,yes,0.0,NaN,yes,4545.0,23223,32,urban
8,89.0,NaN,no,NaN,NaN,no,4.0,323,323,rural

In [5]:
dataset.fillna({"Married": dataset["Married"].mode()[0]}, inplace=True)

In [6]:
dataset.fillna({"Gender": dataset["Gender"].mode()[0]}, inplace=True)

In [7]:
en_data=dataset[["Gender","Married"]]

In [8]:
pd.get_dummies(en_data)

   Gender_female  Gender_male  Married_no  Married_yes
0          False         True        True        False
1           True        False       False         True
2          False         True        True        False
3           True        False        True        False
4           True        False       False         True
5           True        False        True        False
6           True        False        True        False
7          False         True       False         True
8           True        False        True        False

In [9]:
pd.get_dummies(en_data).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Gender_female  9 non-null      bool
 1   Gender_male    9 non-null      bool
 2   Married_no     9 non-null      bool
 3   Married_yes    9 non-null      bool
dtypes: bool(4)
memory usage: 168.0 bytes

In [10]:
from sklearn.preprocessing import OneHotEncoder

In [11]:
ohe=OneHotEncoder()

In [12]:
ar=ohe.fit_transform(en_data).toarray()

In [13]:
ar

array([[0., 1., 1., 0.],
       [1., 0., 0., 1.],
       [0., 1., 1., 0.],
       [1., 0., 1., 0.],
       [1., 0., 0., 1.],
       [1., 0., 1., 0.],
       [1., 0., 1., 0.],
       [0., 1., 0., 1.],
       [1., 0., 1., 0.]])

In [14]:
print(dataset["Gender"].unique())

['male' 'female']

In [15]:
pd.DataFrame(ar,columns=["Gender_female","Gender_male"," Married_no "," Married_no "])

   Gender_female  Gender_male   Married_no    Married_no
0            0.0          1.0           1.0           0.0
1            1.0          0.0           0.0           1.0
2            0.0          1.0           1.0           0.0
3            1.0          0.0           1.0           0.0
4            1.0          0.0           0.0           1.0
5            1.0          0.0           1.0           0.0
6            1.0          0.0           1.0           0.0
7            0.0          1.0           0.0           1.0
8            1.0          0.0           1.0           0.0

In [16]:
ohe=OneHotEncoder(drop="first")

In [17]:
ar=ohe.fit_transform(en_data).toarray()

In [18]:
ar

array([[1., 0.],
       [0., 1.],
       [1., 0.],
       [0., 0.],
       [0., 1.],
       [0., 0.],
       [0., 0.],
       [1., 1.],
       [0., 0.]])

In [19]:
pd.DataFrame(ar,columns=["Gender_male"," Married_no "])

   Gender_male   Married_no
0          1.0           0.0
1          0.0           1.0
2          1.0           0.0
3          0.0           0.0
4          0.0           1.0
5          0.0           0.0
6          0.0           0.0
7          1.0           1.0
8          0.0           0.0